export default {
  translation: {
    key_one: 'sex',
    key_many: 'supper_sex',
    chatPage: {
      messages:{
        mes_one: 'Сообщение',
        mes_few: 'Сообщения',
        mes_five: 'Сообщений',
        mes_many: 'Сообщений',
      },
      placeholder: 'Введите сообщение',
      noMessages: 'Нет сообщений',
    },
    404: {
      subheader: 'Ой! Страница пропала',
      paragraf: 'Возможно, она переехала или никогда не существовала.',
      toHome: '🏠 На главную',
      back: '↩️ Назад',
    },
    navbar: {
      name: 'Hexlet Chat',
      logIn: 'Вход',
      logOut: 'Выйти',
      signUp: 'Регистрация',
    },
    channel: {
      rename: 'Переименовать',
      delete: 'Удалить',
      error: {
        unknown: 'Неизвестная ошибка',
        loading: 'Не удалось загрузить каналы:',
      },
    },
    logInPage: {
      header: 'Вход',
      name: 'Ваш ник',
      password: 'Пароль',
      button: 'Войти',
      linkPrefix: 'Нет аккаунта?',
      link: 'Регистрация',
    },
  }
}