export default {
  translation: {
    key_one: 'sex',
    key_many: 'supper_sex',
    invalidAuth: 'Неверные имя пользователя или пароль',
    chatPage: {
      messages:{
        mes_one: 'Сообщение',
        mes_few: 'Сообщения',
        mes_five: 'Сообщений',
        mes_many: 'Сообщений',
      },
      placeholder: 'Введите сообщение',
      noMessages: 'Нет сообщений',
    },
    404: {
      subheader: 'Ой! Страница пропала',
      paragraf: 'Возможно, она переехала или никогда не существовала.',
      toHome: '🏠 На главную',
      back: '↩️ Назад',
    },
    navbar: {
      name: 'Hexlet Chat',
      logIn: 'Вход',
      logOut: 'Выйти',
      signUp: 'Регистрация',
    },
    channel: {
      addChannel: 'Добавить канал',
      deleteChannel: 'Удалить канал',
      renameChannel: 'Переименовать канал',
      header: 'Каналы',
      rename: 'Переименовать',
      delete: 'Удалить',
      confirm: 'Уверены?',
      error: {
        loading: 'Не удалось загрузить каналы:',
        exist: 'Канал с таким именем уже существует!',
        unknown: 'unknown',
      },
    },
    logInPage: {
      header: 'Вход',
      name: 'Имя пользователя',
      password: 'Пароль',
      button: 'Войти',
      linkPrefix: 'Нет аккаунта?',
      link: 'Регистрация',
    },
    signUpPage: {
      header: 'Регистрация',
      name: 'Имя пользователя',
      password: 'Пароль',
      confirmPassword: 'Подтвердите пароль',
      button: 'Зарегистрироваться',
    },
    validation: {
      signUp: 'От 3 до 20 символов',
      min: 'Название должно быть не менее 3 символов!',
      max: 'Название должно быть не более 20 символов!',
      required: 'Обязательное поле!',
      channelIsExist: 'Канал уже существует!',
      confirm: 'Пароли должны совпадать',
      minPas: 'Не менее 6 символов',
      usernameTaken: 'Такой пользователь уже существует'
      
    },
    modals: {
      cancel: 'Отменить',
      send: 'Отправить',
    },
    toast: {
      error: 'Ошибка',
      networkError: 'Ошибка соединения',
      channelAdd: 'Канал создан',
      channelRemove: 'Канал удалён',
      channelRename: 'Канал переименован',
    },
  },
}